Repository: Megatron-soft/help-homeles
Catalog: lib/l10n/app_*.arb
Languages: ar

# title
source: Help homeless
ar: ساعد المحتاجين

source: Add
ar: ضف

source: Locate Me
ar: حدد موقعي

# update
source: Update Data
ar: حدث البيانات

# addNewPerson
source: Add a New Person
ar: ضف شخص جديد

# updatePerson
source: Update Person's Data
ar: حدث بيانات الشخص

# pickImage
source: Pick an Image
ar: اختر صورة

# takePicture
source: Take a Picture
ar: التقط صورة

# pleaseWaitLocation
source: Please wait while your location is determined
ar: برجاء الانتظار ليتم تحديد موقعك

# locationFetchedSucc
source: Location determined successfully
ar: تم تحديد الموقع بنجاح

# checkLocation
source: Please ensure location services are enabled
ar: برجاء التأكد من خدمة الموقع

# locationPermission
source: Please grant location permission to proceed
ar: يرجى منح إذن الموقع للمتابعة

# enterAllData
source: Please enter all data correctly
ar: برجاء ادخال جميع البيانات بطريقة صحيحة

source: Submit
ar: قدم

source: Save
ar: حفظ

# updateLocation
source: Update Your Location
ar: حدث موقعك

# cannotFindPeople
source: cannot find people with specified needs
ar: لا يمكن العثور على أشخاص لديهم الاحتياجات المحددة

# noHomelessPeople
source: No Homeless people around you right now
ar: لا يوجد أشخاص بلا مأوى بالقرب منك حاليًا

source: Try again
ar: حاول مرة أخرى

source: Open Location
ar: الموقع

# meter
source: m
ar: م

source: Any
ar: اي مسافة

source: Homeless Angels
ar: الاشخاص المحتاجين

source: Need
ar: احتياج

source: Distance
ar: مسافة

source: Food
ar: طعام

source: Shelter
ar: مأوي

source: Water
ar: مياه

source: Clothes
ar: ملابس

source: Blanket
ar: غطاء

source: Financial
ar: مساعدة مادية

# medical
source: Medical Care
ar: مساعدة طبية
